In [45]:
import pandas as pd
import numpy as np

In [46]:
nitesh=pd.read_csv("even2.csv")
nitesh

    name          city     age language
0  even            goa      22   python
1    sam      karnatka      25     java
2    jay         delhi      45      ccc

In [47]:
nitesh.index

RangeIndex(start=0, stop=3, step=1)

In [48]:
nitesh.columns

Index(['name', '   city', '   age', 'language'], dtype='object')

In [49]:
nitesh.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of     name          city     age language
0  even            goa      22   python
1    sam      karnatka      25     java
2    jay         delhi      45      ccc>

In [50]:
nitesh.count()

name        3
   city     3
   age      3
language    3
dtype: int64

In [51]:
nitesh

    name          city     age language
0  even            goa      22   python
1    sam      karnatka      25     java
2    jay         delhi      45      ccc

In [52]:
nitesh.describe()

             age
count   3.000000
mean   30.666667
std    12.503333
min    22.000000
25%    23.500000
50%    25.000000
75%    35.000000
max    45.000000

In [53]:
nitesh.loc[1]

name                 sam
   city         karnatka
   age                25
language            java
Name: 1, dtype: object

In [54]:
nitesh.dtypes

name        object
   city     object
   age       int64
language    object
dtype: object

In [55]:
nitesh.language

0    python
1      java
2       ccc
Name: language, dtype: object

In [56]:
nitesh.head(1)

    name    city     age language
0  even      goa      22   python

In [57]:
nitesh.tail(1)

  name       city     age language
2  jay      delhi      45      ccc

In [58]:
nitesh.iloc[0,1:3]

   city      goa
   age        22
Name: 0, dtype: object

In [59]:
nitesh

    name          city     age language
0  even            goa      22   python
1    sam      karnatka      25     java
2    jay         delhi      45      ccc

In [61]:
nitesh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      3 non-null      object
 1      city   3 non-null      object
 2      age    3 non-null      int64
 3   language  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [63]:
nitesh.any()

name        True
   city     True
   age      True
language    True
dtype: bool

In [64]:
nitesh.isna()

    name     city     age  language
0  False    False   False     False
1  False    False   False     False
2  False    False   False     False

In [65]:
nitesh.isnull()

    name     city     age  language
0  False    False   False     False
1  False    False   False     False
2  False    False   False     False

In [66]:
nitesh

    name          city     age language
0  even            goa      22   python
1    sam      karnatka      25     java
2    jay         delhi      45      ccc

In [71]:
nitesh.to_csv("even3.csv")
nitesh

    name          city     age language
0  even            goa      22   python
1    sam      karnatka      25     java
2    jay         delhi      45      ccc